from collections import defaultdict
from collections import Counter
from collections import deque
import collections
import enum
from re import A
#import numpy as np

import sys
import argparse
import math
import random
from tkinter import N
# https://www.daleseo.com/python-typing/
from typing import Optional
from typing import Union
from typing import List
from typing import Final
from typing import Dict
from typing import Tuple
from typing import Set

import time
import heapq
from bisect import bisect_left , bisect_right

timeFlag = 0
debugFlag = 0
import math

class Solution:
    def kInversePairs(self, n: int, k: int) -> int:
        if k == 0:
            return 1
        if n == 1:
            return 0
        table = {}
        for i in range(n-1):
            for j in range(n):
                if i+j not in table:
                    table[i+j] = 0
                table[i+j] += 1
        # print("n:", n , "k:" , k ,"table:",table)
        
        ans = table
        for lop in reversed(range(2,n-1)):
            localans = {}
            for a in range(lop):
                if a > k :
                    break
                for inx,val in ans.items():
                    if inx+a not in localans:
                        localans[inx+a] = 0
                    localans[inx+a] += val
            ans = localans
            # print("localans:",localans)
        # print("ans:",ans)
        if k in ans:
            return ans[k] % (10**9+7)
        else :
            return 0
        
def run(s,s1,expect):
    # print(len(s)," ",end="")
    start = time.time()
    A = Solution()
    r = A.kInversePairs(s,s1)
    print(" total_time1 : ", time.time() - start , "-> ", end="") 
    
    if r == expect:
        print("SUCCESS -> ",end="")
    else :
        print("ERROR(",expect,") -> ",sep="",end="")
    print(r, s , end="")  
    print()

if (__name__ == "__main__"):
    parser = argparse.ArgumentParser(
        prog='kInversePairs.py',
        description=
        'kInversePairs'
    )
    parser.add_argument( '--debug', '-d' , action='store_const' , const=1 , help='debug on')

    args = parser.parse_args()
    debug = args.debug
    if not debug:
        debug = 0

    print('kInversePairs problem :')

    run(10,15,110010)
    run(15,15,19664205)
    run(30,15,688272989)
    run(50,15,932975515)
    run(70,15,404529997)
    run(100,15,687491764)     
    run(100,1000,589091451)     
    
# $  python3 kInversePairs_v2.py
# kInversePairs problem :
#  total_time1 :  0.00020313262939453125 -> SUCCESS -> 110010 10
#  total_time1 :  0.001058340072631836 -> SUCCESS -> 19664205 15
#  total_time1 :  0.016200542449951172 -> SUCCESS -> 688272989 30
#  total_time1 :  0.14369940757751465 -> SUCCESS -> 932975515 50
#  total_time1 :  0.5862057209014893 -> SUCCESS -> 404529997 70
#  total_time1 :  2.5641469955444336 -> SUCCESS -> 687491764 100

# 1 0 1 [1] 
# 2 0 1 [1,2](0) oldVal=0  oldLen=2
# 2 1 1 [2,1](1) oldVal=1  oldLen=2
# 3일때 
# [3,1,2](oldLen + oldVal=0) [1,3,2](oldLen-1 + oldVal) [1,2,3] (oldLen-2 + oldVal)
# [3,2,1](oldLen + oldVal=1) [2,3,1] [2,1,3]
# 3 0 1 [1,2,3]
# 3 1 2 [2,1,3] [1,3,2]
# 3 2 2 [3,2,1] [3,1,2]
# 4 1 3
# 4 2 5

# q 갯수 증가
# 1 -> 1 
# 2 -> 2 * 1
# 0 1
# 3 ->  3* 2
# 0 1 2
# 1 2 3
# 4 -> 4 * 3 * 2 

# q Val 구조
# 4일대 위처럼 24개로 4 * 3 * 2
# 0 1 2 3
# 1 2 3 4
# 2 3 4 5
# 1 2 3 4
# 2 3 4 5
# 3 4 5 6

# 5* 4 * (3*2) = 120
# 0 1 2 3 4
# 1 2 3 4 5
# 2 3 4 5 6
# 3 4 5 6 7

# 1 2 3 4 5
# 2 3 4 5 6
# 3 4 5 6 7
# 4 5 6 7 8

# 2 3 4 5 6
# 3 4 5 6 7
# 4 5 6 7 8
# 5 6 7 8 9 

# 3 4 5 6 7
# 4 5 6 7 8
# 5 6 7 8 9 
# 6 7 8 9 10

# i: 2 n: 6 k: 10 q: [(1, 0)] 1
# i: 3 n: 6 k: 10 q: [(2, 0), (2, 1)] 2
# i: 4 n: 6 k: 10 q: [  n이 3일때
#     (3, 0), (3, 1), (3, 2), 
#     (3, 1), (3, 2), (3, 3)] 6
# i: 5 n: 6 k: 10 q: [ n이 4일때 2번 반복
#     (4, 0), (4, 1), (4, 2), (4, 3), 
#     (4, 1), (4, 2), (4, 3), (4, 4), 
#     (4, 2), (4, 3), (4, 4), (4, 5), 
    
#     (4, 1), (4, 2), (4, 3), (4, 4), 
#     (4, 2), (4, 3), (4, 4), (4, 5), 
#     (4, 3), (4, 4), (4, 5), (4, 6)] 24
# i: 6 n: 6 k: 10 q: [  n이 5일때 3번씩 2번 반복
#     (5, 0), (5, 1), (5, 2), (5, 3), (5, 4), 
#     (5, 1), (5, 2), (5, 3), (5, 4), (5, 5), 
#     (5, 2), (5, 3), (5, 4), (5, 5), (5, 6), 
#     (5, 3), (5, 4), (5, 5), (5, 6), (5, 7), 
    
#     (5, 1), (5, 2), (5, 3), (5, 4), (5, 5), 
#     (5, 2), (5, 3), (5, 4), (5, 5), (5, 6), 
#     (5, 3), (5, 4), (5, 5), (5, 6), (5, 7), 
#     (5, 4), (5, 5), (5, 6), (5, 7), (5, 8), 
    
#     (5, 2), (5, 3), (5, 4), (5, 5), (5, 6), 
#     (5, 3), (5, 4), (5, 5), (5, 6), (5, 7), 
#     (5, 4), (5, 5), (5, 6), (5, 7), (5, 8), 
#     (5, 5), (5, 6), (5, 7), (5, 8), (5, 9), 
    
#     (5, 1), (5, 2), (5, 3), (5, 4), (5, 5), (5, 2), (5, 3), (5, 4), (5, 5), (5, 6), (5, 3), (5, 4), (5, 5), (5, 6), (5, 7), (5, 4), (5, 5), (5, 6), (5, 7), (5, 8), (5, 2), (5, 3), (5, 4), (5, 5), (5, 6), (5, 3), (5, 4), (5, 5), (5, 6), (5, 7), (5, 4), (5, 5), (5, 6), (5, 7), (5, 8), (5, 5), (5, 6), (5, 7), (5, 8), (5, 9), (5, 3), (5, 4), (5, 5), (5, 6), (5, 7), (5, 4), (5, 5), (5, 6), (5, 7), (5, 8), (5, 5), (5, 6), (5, 7), (5, 8), (5, 9), (5, 6), (5, 7), (5, 8), (5, 9), (5, 10)] 120
# n: 6 k: 10 q: [(6, 0), (6, 1), (6, 2), (6, 3), (6, 4), (6, 5), (6, 1), (6, 2), (6, 3), (6, 4), (6, 5), (6, 6), (6, 2), (6, 3), (6, 4), (6, 5), (6, 6), (6, 7), (6, 3), (6, 4), (6, 5), (6, 6), (6, 7), (6, 8), (6, 4), (6, 5), (6, 6), (6, 7), (6, 8), (6, 9), (6, 1), (6, 2), (6, 3), (6, 4), (6, 5), (6, 6), (6, 2), (6, 3), (6, 4), (6, 5), (6, 6), (6, 7), (6, 3), (6, 4), (6, 5), (6, 6), (6, 7), (6, 8), (6, 4), (6, 5), (6, 6), (6, 7), (6, 8), (6, 9), (6, 5), (6, 6), (6, 7), (6, 8), (6, 9), (6, 10), (6, 2), (6, 3), (6, 4), (6, 5), (6, 6), (6, 7), (6, 3), (6, 4), (6, 5), (6, 6), (6, 7), (6, 8), (6, 4), (6, 5), (6, 6), (6, 7), (6, 8), (6, 9), (6, 5), (6, 6), (6, 7), (6, 8), (6, 9), (6, 10), (6, 6), (6, 7), (6, 8), (6, 9), (6, 10), (6, 11), (6, 3), (6, 4), (6, 5), (6, 6), (6, 7), (6, 8), (6, 4), (6, 5), (6, 6), (6, 7), (6, 8), (6, 9), (6, 5), (6, 6), (6, 7), (6, 8), (6, 9), (6, 10), (6, 6), (6, 7), (6, 8), (6, 9), (6, 10), (6, 11), (6, 7), (6, 8), (6, 9), (6, 10), (6, 11), (6, 12), (6, 1), (6, 2),...



# n일때 아래 내용을 n * n-1 * (n-2*...*1)
# (n-2*...*1)까지 할 필요가 없고  k 까지만 하면 된다.
# 0 1 2 ... n-1
# 1 2 3 ... n
# ...
# n-2 ...   2n-3

# 1 2 3 ... n
# ...
# n-2 ...   2n-3
# n-1 ...   2n-2

# k <= 1000
# 위의 것을 max 1000번만 더하면 된다.
# 처음 start하는 값이 k이면 그게 끝.

# # this is timeout
# i: 2 n: 3 k: 10 q: [(1, 0)]
# i: 3 n: 3 k: 10 q: [(2, 0), (2, 1)]
# n: 3 k: 10 q: [(3, 0), (3, 1), (3, 2), (3, 1), (3, 2), (3, 3)]
# i: 2 n: 3 k: 1 q: [(1, 0)]
# i: 3 n: 3 k: 1 q: [(2, 0), (2, 1)]
# n: 3 k: 1 q: [(3, 0), (3, 1), (3, 2), (3, 1), (3, 2), (3, 3)]
# i: 2 n: 3 k: 2 q: [(1, 0)]
# i: 3 n: 3 k: 2 q: [(2, 0), (2, 1)]
# n: 3 k: 2 q: [(3, 0), (3, 1), (3, 2), (3, 1), (3, 2), (3, 3)]
# i: 2 n: 4 k: 1 q: [(1, 0)]
# i: 3 n: 4 k: 1 q: [(2, 0), (2, 1)]
# i: 4 n: 4 k: 1 q: [(3, 0), (3, 1), (3, 2), (3, 1), (3, 2), (3, 3)]
# n: 4 k: 1 q: [(4, 0), (4, 1), (4, 2), (4, 3), (4, 1), (4, 2), (4, 3), (4, 4), (4, 2), (4, 3), (4, 4), (4, 5), (4, 1), (4, 2), (4, 3), (4, 4), (4, 2), (4, 3), (4, 4), (4, 5), (4, 3), (4, 4), (4, 5), (4, 6)]
# i: 2 n: 4 k: 2 q: [(1, 0)]
# i: 3 n: 4 k: 2 q: [(2, 0), (2, 1)]
# i: 4 n: 4 k: 2 q: [(3, 0), (3, 1), (3, 2), (3, 1), (3, 2), (3, 3)]
# n: 4 k: 2 q: [(4, 0), (4, 1), (4, 2), (4, 3), (4, 1), (4, 2), (4, 3), (4, 4), (4, 2), (4, 3), (4, 4), (4, 5), (4, 1), (4, 2), (4, 3), (4, 4), (4, 2), (4, 3), (4, 4), (4, 5), (4, 3), (4, 4), (4, 5), (4, 6)]


# 7
# 15
# 1
# 0
# 1
# 1
# 1
# 2
# 3
# 10
# 3
# 0
# 3
# 1
# 3
# 2
# 4
# 1
# 4
# 2